!==================================================================================================
! 子程序包: SST_CCD (Cell-Centered Dispersion Package for Soil Salt Transport Process)
! 主要功能: 模拟土壤单元体之间盐分的弥散迁移
! 创建日期: 2020年7月8日
! 修改日志:
!==================================================================================================


SUBROUTINE SST_CCD_DF
!**************************************************************************************************
! 读取模型定义参数
!**************************************************************************************************
  IMPLICIT NONE
  
  RETURN
END SUBROUTINE SST_CCD_DF


SUBROUTINE SST_CCD_AL
!**************************************************************************************************
! 为数组变量分配内存并初始化
!**************************************************************************************************
  USE :: VAR
  IMPLICIT NONE

  IF (.NOT. ALLOCATED(CCV)) ALLOCATE(CCV(NCEL, 2), SOURCE = 0.0)

  RETURN
END SUBROUTINE SST_CCD_AL


SUBROUTINE SST_CCD_FM
!**************************************************************************************************
! 计算表示土壤单元体之间盐分弥散迁移的方程组系数
!**************************************************************************************************
  USE :: VAR
  IMPLICIT NONE

  ! 局部变量
  INTEGER :: I
  REAL :: DELV1, DELV2

  ! 第 2 至 NCEL - 1 单元体
  DO I = 2, NCEL - 1
    DELV1 = (DELV(I - 1) + DELV(I)) * 0.5
    DELV2 = (DELV(I + 1) + DELV(I)) * 0.5
    CCV(I, 1) = DELT * DIS(I, 1) / DELV1
    CCV(I, 2) = DELT * DIS(I, 2) / DELV2
  END DO
  
  ! 第 1 单元体
  I = 1
  DELV2 = (DELV(I + 1) + DELV(I)) * 0.5
  CCV(I, 2) = DELT * DIS(I, 2) / DELV2
  
  ! 第 NCEL 单元体
  I = NCEL
  DELV1 = (DELV(I - 1) + DELV(I)) * 0.5
  CCV(I, 1) = DELT * DIS(I, 1) / DELV1

  RETURN
END SUBROUTINE SST_CCD_FM


SUBROUTINE SST_CCD_BD
!**************************************************************************************************
! 计算表示土壤单元体之间盐分弥散迁移的均衡项
!**************************************************************************************************
  IMPLICIT NONE

  RETURN
END SUBROUTINE SST_CCD_BD


SUBROUTINE SST_CCD_DA
!**************************************************************************************************
! 释放数组变量内存
!**************************************************************************************************
  USE :: VAR
  IMPLICIT NONE

  IF (ALLOCATED(CCV)) DEALLOCATE(CCV)

  RETURN
END SUBROUTINE SST_CCD_DA

