!==================================================================================================
! 子程序包: SWF_SSK (Source and Sink Pacakge for Soil Water Flow Process)
! 主要功能: 模拟土壤剖面源/汇
! 创建日期: 2020年9月21日
! 修改日志:
!==================================================================================================


SUBROUTINE SWF_SSK_DF
!**************************************************************************************************
! 读取模型定义参数
!**************************************************************************************************
  IMPLICIT NONE

  RETURN
END SUBROUTINE SWF_SSK_DF


SUBROUTINE SWF_SSK_AL
!**************************************************************************************************
! 为数组变量分配内存并初始化
!**************************************************************************************************
  USE :: VAR
  IMPLICIT NONE

  IF (.NOT. ALLOCATED(WSS)) ALLOCATE(WSS(NCEL), SOURCE = 0.0)

  RETURN
END SUBROUTINE SWF_SSK_AL


SUBROUTINE SWF_SSK_RP
!**************************************************************************************************
! 为数组变量读取数据并执行准备工作
!**************************************************************************************************
  USE :: VAR
  IMPLICIT NONE

  ! 函数声明
  LOGICAL :: RDINQR

  ! 从 S_IN_SOL 文件读取数据
  CALL RDINIT(U_IN_SOL, U_LOG, S_IN_SOL)
  IF (RDINQR('WSS')) THEN
    CALL RDFREA('WSS', WSS, NCEL, NCEL)
  END IF

  RETURN
END SUBROUTINE SWF_SSK_RP


SUBROUTINE SWF_SSK_FM
!**************************************************************************************************
! 计算表示根系吸水的方程组系数
!**************************************************************************************************
  USE :: VAR
  IMPLICIT NONE

  RHS(:) = RHS(:) + DELT * WSS(:)

  RETURN
END SUBROUTINE SWF_SSK_FM


SUBROUTINE SWF_SSK_DA
!**************************************************************************************************
! 释放数组变量内存
!**************************************************************************************************
  USE :: VAR
  IMPLICIT NONE

  IF (ALLOCATED(WSS)) DEALLOCATE(WSS)

  RETURN
END SUBROUTINE SWF_SSK_DA

